In [2]:
%load_ext sql
%sql mysql+mysqlconnector://blackbasil:Naveen%402193@localhost/de_project

In [ ]:
%%sql

CREATE TABLE sales (
    TransactionID INT PRIMARY KEY,
    Store CHAR(1) CHECK (Store IN ('A', 'B')),
    SalesAmount DECIMAL(10, 2),
    TotalSales DECIMAL(12, 2)
);

INSERT INTO sales (TransactionID, Store, SalesAmount, TotalSales) VALUES
(1, 'A', 100.00, 100.00),
(2, 'A', 150.00, 250.00),
(3, 'B', 200.00, 200.00),
(4, 'A', 75.00, 325.00),
(5, 'B', 50.00, 250.00),
(6, 'B', 125.00, 375.00);

 * mysql+mysqlconnector://blackbasil:***@localhost/de_project
0 rows affected.
6 rows affected.

[]

In [7]:
%%sql

select TransactionID, Store , SalesAmount, sum(SalesAmount) over (partition by Store order by TransactionID desc) AS TotalSales
from sales;

 * mysql+mysqlconnector://blackbasil:***@localhost/de_project
6 rows affected.

[(4, 'A', Decimal('75.00'), Decimal('75.00')),
 (2, 'A', Decimal('150.00'), Decimal('225.00')),
 (1, 'A', Decimal('100.00'), Decimal('325.00')),
 (6, 'B', Decimal('125.00'), Decimal('125.00')),
 (5, 'B', Decimal('50.00'), Decimal('175.00')),
 (3, 'B', Decimal('200.00'), Decimal('375.00'))]

In [5]:
%%sql

select TransactionId, Store, SalesAmount,
ROW_NUMBER() OVER (partition by store order by SalesAmount desc) as ROWNUM
from sales;

 * mysql+mysqlconnector://blackbasil:***@localhost/de_project
6 rows affected.

[(2, 'A', Decimal('150.00'), 1),
 (1, 'A', Decimal('100.00'), 2),
 (4, 'A', Decimal('75.00'), 3),
 (3, 'B', Decimal('200.00'), 1),
 (6, 'B', Decimal('125.00'), 2),
 (5, 'B', Decimal('50.00'), 3)]

In [9]:
%%sql

drop table if exists Employees;
create table Employees(
    EmployeeID INT,
    Name VARCHAR(100),
    Department VARCHAR(50),
    HireDate DATE
)

 * mysql+mysqlconnector://blackbasil:***@localhost/de_project
0 rows affected.
0 rows affected.

[]

In [13]:
%%sql

INSERT INTO Employees (EmployeeID, Name, Department, HireDate)
VALUES 
(1, 'Alice Johnson', 'HR', '2020-03-15'),
(2, 'Bob Smith', 'Engineering', '2019-07-22'),
(2, 'Bob Smith', 'Engineering', '2021-05-22'),
(4, 'Diana Prince', 'Finance', '2022-06-05'),
(4, 'Diana Prince', 'Finance', '2024-07-23')

 * mysql+mysqlconnector://blackbasil:***@localhost/de_project
5 rows affected.

[]

In [14]:
%%sql
select * from Employees;

 * mysql+mysqlconnector://blackbasil:***@localhost/de_project
5 rows affected.

[(1, 'Alice Johnson', 'HR', datetime.date(2020, 3, 15)),
 (2, 'Bob Smith', 'Engineering', datetime.date(2019, 7, 22)),
 (2, 'Bob Smith', 'Engineering', datetime.date(2021, 5, 22)),
 (4, 'Diana Prince', 'Finance', datetime.date(2022, 6, 5)),
 (4, 'Diana Prince', 'Finance', datetime.date(2024, 7, 23))]

In [17]:
%%sql
with EmployeeRank as (
select EmployeeID, Name , Department, HireDate, 
ROW_NUMBER() over (partition by EmployeeID order by HireDate asc) as rownum from Employees
)

select * from EmployeeRank where rownum =1

 * mysql+mysqlconnector://blackbasil:***@localhost/de_project
3 rows affected.

[(1, 'Alice Johnson', 'HR', datetime.date(2020, 3, 15), 1),
 (2, 'Bob Smith', 'Engineering', datetime.date(2019, 7, 22), 1),
 (4, 'Diana Prince', 'Finance', datetime.date(2022, 6, 5), 1)]